Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs.InstanceId
The Revit id of the external data instance being removed from Revit document.
Since:
2023

Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs.TypeId
The type id of the external data instance id being removed from Revit document.
Since:
2023

Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
The event arguments used by the ExternalDataInstanceRemovingFrom event.
Since:
2023